{"config": [{"config": {"name": "lambda_1", "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001e<ipython-input-8-abfb1c7be0e5>\u00da\b<lambda>\u0005\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 80, 160, 3], "trainable": true, "output_shape_type": "raw", "output_shape": null, "input_dtype": "float32", "function_type": "lambda"}, "class_name": "Lambda"}, {"config": {"name": "convolution2d_1", "dim_ordering": "tf", "W_constraint": null, "nb_col": 5, "activity_regularizer": null, "trainable": true, "border_mode": "valid", "input_dtype": "float32", "b_regularizer": null, "init": "he_normal", "nb_row": 5, "subsample": [2, 2], "batch_input_shape": [null, 80, 160, 3], "bias": true, "W_regularizer": null, "b_constraint": null, "nb_filter": 24, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"name": "elu_1", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "convolution2d_2", "dim_ordering": "tf", "W_constraint": null, "nb_col": 5, "activity_regularizer": null, "trainable": true, "border_mode": "valid", "b_regularizer": null, "init": "he_normal", "nb_row": 5, "subsample": [2, 2], "b_constraint": null, "bias": true, "W_regularizer": null, "nb_filter": 36, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"name": "elu_2", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "convolution2d_3", "dim_ordering": "tf", "W_constraint": null, "nb_col": 5, "activity_regularizer": null, "trainable": true, "border_mode": "valid", "b_regularizer": null, "init": "he_normal", "nb_row": 5, "subsample": [2, 2], "b_constraint": null, "bias": true, "W_regularizer": null, "nb_filter": 48, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"name": "elu_3", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "convolution2d_4", "dim_ordering": "tf", "W_constraint": null, "nb_col": 3, "activity_regularizer": null, "trainable": true, "border_mode": "valid", "b_regularizer": null, "init": "he_normal", "nb_row": 3, "subsample": [1, 1], "b_constraint": null, "bias": true, "W_regularizer": null, "nb_filter": 64, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"name": "elu_4", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "convolution2d_5", "dim_ordering": "tf", "W_constraint": null, "nb_col": 3, "activity_regularizer": null, "trainable": true, "border_mode": "valid", "b_regularizer": null, "init": "he_normal", "nb_row": 3, "subsample": [1, 1], "b_constraint": null, "bias": true, "W_regularizer": null, "nb_filter": 64, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"name": "elu_5", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "averagepooling2d_1", "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "border_mode": "valid"}, "class_name": "AveragePooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "bias": true, "b_constraint": null, "trainable": true, "W_constraint": null, "b_regularizer": null, "output_dim": 1164, "init": "he_normal", "activity_regularizer": null, "W_regularizer": null, "input_dim": 384, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "elu_6", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "dense_2", "bias": true, "b_constraint": null, "trainable": true, "W_constraint": null, "b_regularizer": null, "output_dim": 100, "init": "he_normal", "activity_regularizer": null, "W_regularizer": null, "input_dim": 1164, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "elu_7", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "dense_3", "bias": true, "b_constraint": null, "trainable": true, "W_constraint": null, "b_regularizer": null, "output_dim": 50, "init": "he_normal", "activity_regularizer": null, "W_regularizer": null, "input_dim": 100, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "elu_8", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "dense_4", "bias": true, "b_constraint": null, "trainable": true, "W_constraint": null, "b_regularizer": null, "output_dim": 10, "init": "he_normal", "activity_regularizer": null, "W_regularizer": null, "input_dim": 50, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "elu_9", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "dense_5", "bias": true, "b_constraint": null, "trainable": true, "W_constraint": null, "b_regularizer": null, "output_dim": 1, "init": "he_normal", "activity_regularizer": null, "W_regularizer": null, "input_dim": 10, "activation": "linear"}, "class_name": "Dense"}], "keras_version": "1.2.0", "class_name": "Sequential"}